*** Creation Vlan
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 40
Switch(config-vlan)#name TestVlan40
Switch(config-vlan)#end
Switch#

*** lister les interfaces existantes
Switch#sh ip int brief

*** lister les vlans
Switch#sh vlan

*** passage d'une interface dans un vlan
Switch#conf t
Switch(config)#int fa0/14
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 40
Switch(config-if)#end
Switch#

*** passage d'une interface en mode trunk
*** (encapsulation VLAN Id - dot1q)
Switch#conf t
Switch(config)#int fa0/15
Switch(config-if)#switchport mode trunk
Switch(config-if)#end
Switch#

*** Creation et rattachement etherchannel
Switch#conf t
Switch(config)#int fa0/17
Switch(config-if)#channel-group 2 mode desirable
Switch(config-if)#int fa0/18
Switch(config-if)#channel-group 2 mode desirable
Switch(config-if)#end
Switch#

*** visualisation de la configuration device
Switch#sh run

*** visualiser etat des etherchannels
Switch#sh etherchannel summary

*** Autoriser ou non un vlan sur trunk
*** tous les vlans sauf le 10 (ex : 1-5,7-8,9,11,15...)
Switch(config)#int fa0/1
Switch(config-if)#switchport trunk allowed vlan except 10
Switch(config-if)#end
Switch#

*** Activer le VTP (Vlan Trunking Protocol)
*** Sur le serveur
1erEtage(config)#vtp mode server
1erEtage(config)#vtp domain cnam
*** Sur les clients
2emeEtage(config)#vtp mode client
2emeEtage(config)#vtp domain cnam
*** Verifier l'état du VTP
#show vtp status


*** Paramètrage et Activation IP sur les interfaces du routeurs (sans dot1q)
Router#conf t
Router(config)#int fa0/0
Router(config-if)#ip address 10.1.1.254 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#int fa0/1
Router(config-if)#ip address 10.1.2.254 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#int e0/0/0
Router(config-if)#ip address 10.1.3.254 255.255.255.0
Router(config-if)#no shutdown

*** Visualiser la table de routage d'un routeurs
Router#sh ip route

*** création de sous interfaces dot1q sur un routeurs
Router#conf t
! nettoyage de l'interface physique
Router(config)#int fa0/0
Router(config-if)#no ip address 10.1.1.254 255.255.255.0
! création des sous-interfaces logiques
Router(config-if)#int fa0/0.10
Router(config-subif)#encapsulation dot1Q 10
Router(config-subif)#ip address 10.1.1.254 255.255.255.0
Router(config-subif)#int fa0/0.20
Router(config-subif)#encapsulation dot1Q 20
Router(config-subif)#ip address 10.1.2.254 255.255.255.0
Router(config-subif)#int fa0/0.30
Router(config-subif)#encapsulation dot1Q 30
Router(config-subif)#ip address 10.1.3.254 255.255.255.0
Router(config-subif)#exit
Router(config)#exit
Router#

*** Mise en place du routage (ospf
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
! On active le processus 10 ospf sur ce routeur
R1(config)#router ospf 10
! On fait de l'ospf sur le lien wan 1.1.1.4 > relation de voisinage
R1(config-router)#network 1.1.1.4 0.0.0.3 area 1
! On fait de l'ospf sur le lien wan 10.1.1.0 > Annoncer le LAN
R1(config-router)#network 10.1.1.0 0.0.0.255 area 1
R1(config-router)#^Z
R1#

*** Editer les voisins Ospf
R1#sh ip ospf neighbor
Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.9           0   FULL/  -        00:00:37    1.1.1.6         Serial0/0/0
10.1.2.254        0   FULL/  -        00:00:38    1.1.1.17        Serial0/0/1
R1#

*** Mettre un poids ospf sur un lien
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int s0/0/1
R1(config-if)#ip ospf cost 2000
R1(config-if)#^Z
R1#

*** Changement du poids de la distance administrative d'une route statique
R1#
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip route 10.1.2.0 255.255.255.0 1.1.1.17 120
R1(config)#^Z
R1#
